; domain
(define (domain 'domain-a03')
  (:types
    block - NO_TYPE
  )

  (:predicates
    (ontable ?x0 - block)
    (on ?x0 - block ?x1 - block)
    (clear ?x0 - block)
    (emptyhand)
    (holding ?x0 - block)
    (f_copy)
    (f_sync)
    (f_world)
    (f_ok)
    (f_goal)
    (q_1)
    (q_1s)
    (q_1t)
    (q_2)
    (q_2s)
    (q_2t)
    (q_3)
    (q_3s)
    (q_3t)
    (q_4)
    (q_4s)
    (q_4t)
    (q_5)
    (q_5s)
    (q_5t)
    (q_6)
    (q_6s)
    (q_6t)
    (q_7)
    (q_7s)
    (q_7t)
    (q_8)
    (q_8s)
    (q_8t)
    (q_9)
    (q_9s)
    (q_9t)
    (q_10)
    (q_10s)
    (q_10t)
    (q_11)
    (q_11s)
    (q_11t)
    (q_12)
    (q_12s)
    (q_12t)
  )
  (:action pick-up
    :parameters (?x0 - block)
    :precondition 
      (and
        (clear ?x0)
        (ontable ?x0)
        (emptyhand)
        (f_ok)
        (f_world))
    :effect
      (and
        (holding ?x0)
        (f_copy)
        (not 
          (ontable ?x0))
        (not 
          (clear ?x0))
        (not 
          (emptyhand))
        (not 
          (f_world))
      )
    )
  (:action put-down
    :parameters (?x0 - block)
    :precondition 
      (and
        (holding ?x0)
        (f_ok)
        (f_world))
    :effect
      (and
        (clear ?x0)
        (emptyhand)
        (ontable ?x0)
        (f_copy)
        (not 
          (holding ?x0))
        (not 
          (f_world))
      )
    )
  (:action stack
    :parameters (?x0 - block ?x1 - block)
    :precondition 
      (and
        (holding ?x0)
        (clear ?x1)
        (f_ok)
        (f_world))
    :effect
      (and
        (clear ?x0)
        (emptyhand)
        (on ?x0 ?x1)
        (f_copy)
        (not 
          (holding ?x0))
        (not 
          (clear ?x1))
        (not 
          (f_world))
      )
    )
  (:action unstack
    :parameters (?x0 - block ?x1 - block)
    :precondition 
      (and
        (on ?x0 ?x1)
        (clear ?x0)
        (emptyhand)
        (f_ok)
        (f_world))
    :effect
      (and
        (holding ?x0)
        (clear ?x1)
        (f_copy)
        (not 
          (clear ?x0))
        (not 
          (emptyhand))
        (not 
          (on ?x0 ?x1))
        (not 
          (f_world))
      )
    )
  (:action o_copy
    :parameters ()
    :precondition 
      (and
        (f_ok)
        (f_copy))
    :effect
      (and
        (f_sync)
        (q_1t)
        (when
          (q_1)
          (q_1s))
        (when
          (q_2)
          (q_2s))
        (when
          (q_3)
          (q_3s))
        (when
          (q_4)
          (q_4s))
        (when
          (q_5)
          (q_5s))
        (when
          (q_6)
          (q_6s))
        (when
          (q_7)
          (q_7s))
        (when
          (q_8)
          (q_8s))
        (when
          (q_9)
          (q_9s))
        (when
          (q_10)
          (q_10s))
        (when
          (q_11)
          (q_11s))
        (when
          (q_12)
          (q_12s))
        (not 
          (f_copy))
        (not 
          (q_1))
        (not 
          (q_2))
        (not 
          (q_3))
        (not 
          (q_4))
        (not 
          (q_5))
        (not 
          (q_6))
        (not 
          (q_7))
        (not 
          (q_8))
        (not 
          (q_9))
        (not 
          (q_10))
        (not 
          (q_11))
        (not 
          (q_12))
      )
    )
  (:action o_goal
    :parameters ()
    :precondition 
      (and
        (f_world)
        (f_ok)
        (not 
          (q_1))
        (not 
          (q_2))
        (not 
          (q_3))
        (not 
          (q_4))
        (not 
          (q_5))
        (not 
          (q_6))
        (not 
          (q_7))
        (not 
          (q_8))
        (not 
          (q_9))
        (not 
          (q_10))
        (not 
          (q_11)))
    :effect
(f_goal)    )
  (:action o_sync_q_1s_1
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_1t))
    :effect
      (and
        (when
          (q_1s)
          (q_2s))
        (q_2t)
        (when
          (q_1s)
          (not 
            (q_1s)))
        (not 
          (q_1t))
      )
    )
  (:action o_sync_q_1s_2
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_1t))
    :effect
      (and
        (when
          (q_1s)
          (q_9s))
        (when
          (q_1s)
          (q_1))
        (when
          (q_1s)
          (q_11))
        (q_2t)
        (when
          (q_1s)
          (not 
            (q_1s)))
        (not 
          (q_1t))
      )
    )
  (:action o_sync_q_2s
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_2t))
    :effect
      (and
        (when
          (q_2s)
          (q_6s))
        (when
          (q_2s)
          (q_3s))
        (q_3t)
        (when
          (q_2s)
          (not 
            (q_2s)))
        (not 
          (q_2t))
      )
    )
  (:action o_sync_q_3s
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_3t))
    :effect
      (and
        (when
          (q_3s)
          (q_5s))
        (when
          (q_3s)
          (q_4s))
        (q_4t)
        (when
          (q_3s)
          (not 
            (q_3s)))
        (not 
          (q_3t))
      )
    )
  (:action o_sync_q_4s_1
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_4t))
    :effect
      (and
        (when
          (q_4s)
          (q_7s))
        (q_5t)
        (when
          (q_4s)
          (not 
            (q_4s)))
        (not 
          (q_4t))
      )
    )
  (:action o_sync_q_4s_2
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_4t))
    :effect
      (and
        (when
          (q_4s)
          (q_11))
        (when
          (q_4s)
          (q_4))
        (q_5t)
        (when
          (q_4s)
          (not 
            (q_4s)))
        (not 
          (q_4t))
      )
    )
  (:action o_sync_q_5s_1
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_5t))
    :effect
      (and
        (when
          (q_5s)
          (q_8s))
        (q_6t)
        (when
          (q_5s)
          (not 
            (q_5s)))
        (not 
          (q_5t))
      )
    )
  (:action o_sync_q_5s_2
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_5t))
    :effect
      (and
        (when
          (q_5s)
          (q_11))
        (when
          (q_5s)
          (q_5))
        (q_6t)
        (when
          (q_5s)
          (not 
            (q_5s)))
        (not 
          (q_5t))
      )
    )
  (:action o_sync_q_6s_1
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_6t))
    :effect
      (and
        (when
          (q_6s)
          (q_10s))
        (q_7t)
        (when
          (q_6s)
          (not 
            (q_6s)))
        (not 
          (q_6t))
      )
    )
  (:action o_sync_q_6s_2
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_6t))
    :effect
      (and
        (when
          (q_6s)
          (q_11))
        (when
          (q_6s)
          (q_6))
        (q_7t)
        (when
          (q_6s)
          (not 
            (q_6s)))
        (not 
          (q_6t))
      )
    )
  (:action o_sync_q_7s
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_7t))
    :effect
      (and
        (q_8t)
        (when
          (q_7s)
          (not 
            (q_7s)))
        (when
          (and
            (q_7s)
            (not 
              (on b2 b3)))
          (not 
            (f_ok)))
        (not 
          (q_7t))
      )
    )
  (:action o_sync_q_8s
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_8t))
    :effect
      (and
        (q_9t)
        (when
          (q_8s)
          (not 
            (q_8s)))
        (when
          (and
            (q_8s)
            (not 
              (on b1 b2)))
          (not 
            (f_ok)))
        (not 
          (q_8t))
      )
    )
  (:action o_sync_q_9s
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_9t))
    :effect
      (and
        (q_10t)
        (when
          (q_9s)
          (not 
            (q_9s)))
        (when
          (and
            (q_9s)
            (not 
              (ontable b4)))
          (not 
            (f_ok)))
        (not 
          (q_9t))
      )
    )
  (:action o_sync_q_10s
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_10t))
    :effect
      (and
        (q_11t)
        (when
          (q_10s)
          (not 
            (q_10s)))
        (when
          (and
            (q_10s)
            (not 
              (holding b4)))
          (not 
            (f_ok)))
        (not 
          (q_10t))
      )
    )
  (:action o_sync_q_11s
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_11t))
    :effect
      (and
        (q_12t)
        (when
          (q_11s)
          (not 
            (q_11s)))
        (not 
          (q_11t))
      )
    )
  (:action o_sync_q_12s
    :parameters ()
    :precondition 
      (and
        (f_sync)
        (f_ok)
        (q_12t))
    :effect
      (and
        (f_world)
        (when
          (q_1s)
          (q_1))
        (when
          (q_2s)
          (q_2))
        (when
          (q_3s)
          (q_3))
        (when
          (q_4s)
          (q_4))
        (when
          (q_5s)
          (q_5))
        (when
          (q_6s)
          (q_6))
        (when
          (q_7s)
          (q_7))
        (when
          (q_8s)
          (q_8))
        (when
          (q_9s)
          (q_9))
        (when
          (q_10s)
          (q_10))
        (when
          (q_11s)
          (q_11))
        (when
          (q_12s)
          (q_12))
        (when
          (q_12s)
          (not 
            (f_ok)))
        (not 
          (q_12t))
        (not 
          (f_sync))
        (not 
          (q_1s))
        (not 
          (q_2s))
        (not 
          (q_3s))
        (not 
          (q_4s))
        (not 
          (q_5s))
        (not 
          (q_6s))
        (not 
          (q_7s))
        (not 
          (q_8s))
        (not 
          (q_9s))
        (not 
          (q_10s))
        (not 
          (q_11s))
        (not 
          (q_12s))
      )
    )
)

; problem
(define (problem a03)

  (:domain 'domain-a03')
  (:objects b1 - block b2 - block b3 - block b4 - block b5 - block b6 - block)
  (:init 
    (emptyhand)
    (ontable b1)
    (ontable b2)
    (ontable b3)
    (ontable b4)
    (ontable b5)
    (ontable b6)
    (clear b1)
    (clear b2)
    (clear b3)
    (clear b4)
    (clear b5)
    (clear b6)
    (q_1)
    (f_copy)
    (f_ok)
  )
  (:goal (f_goal))

)

; plan
1. (o_copy)
   deleted: (f_copy) (q_1)
   added: (f_sync) (q_1t) (q_1s)
   goals met: 0 of 1
2. (o_sync_q_1s_2)
   deleted: (q_1s) (q_1t)
   added: (q_9s) (q_1) (q_11) (q_2t)
   goals met: 0 of 1
3. (o_sync_q_2s)
   deleted: (q_2t)
   added: (q_3t)
   goals met: 0 of 1
4. (o_sync_q_3s)
   deleted: (q_3t)
   added: (q_4t)
   goals met: 0 of 1
5. (o_sync_q_4s_1)
   deleted: (q_4t)
   added: (q_5t)
   goals met: 0 of 1
6. (o_sync_q_5s_1)
   deleted: (q_5t)
   added: (q_6t)
   goals met: 0 of 1
7. (o_sync_q_6s_1)
   deleted: (q_6t)
   added: (q_7t)
   goals met: 0 of 1
8. (o_sync_q_7s)
   deleted: (q_7t)
   added: (q_8t)
   goals met: 0 of 1
9. (o_sync_q_8s)
   deleted: (q_8t)
   added: (q_9t)
   goals met: 0 of 1
10. (o_sync_q_9s)
   deleted: (q_9s) (q_9t)
   added: (q_10t)
   goals met: 0 of 1
11. (o_sync_q_10s)
   deleted: (q_10t)
   added: (q_11t)
   goals met: 0 of 1
12. (o_sync_q_11s)
   deleted: (q_11t)
   added: (q_12t)
   goals met: 0 of 1
13. (o_sync_q_12s)
   deleted: (q_12t) (f_sync)
   added: (f_world)
   goals met: 0 of 1
14. (pick-up b2)
   deleted: (ontable b2) (clear b2) (emptyhand) (f_world)
   added: (holding b2) (f_copy)
   goals met: 0 of 1
15. (o_copy)
   deleted: (f_copy) (q_1) (q_11)
   added: (f_sync) (q_1t) (q_1s) (q_11s)
   goals met: 0 of 1
16. (o_sync_q_1s_2)
   deleted: (q_1s) (q_1t)
   added: (q_9s) (q_1) (q_11) (q_2t)
   goals met: 0 of 1
17. (o_sync_q_2s)
   deleted: (q_2t)
   added: (q_3t)
   goals met: 0 of 1
18. (o_sync_q_3s)
   deleted: (q_3t)
   added: (q_4t)
   goals met: 0 of 1
19. (o_sync_q_4s_1)
   deleted: (q_4t)
   added: (q_5t)
   goals met: 0 of 1
20. (o_sync_q_5s_1)
   deleted: (q_5t)
   added: (q_6t)
   goals met: 0 of 1
21. (o_sync_q_6s_1)
   deleted: (q_6t)
   added: (q_7t)
   goals met: 0 of 1
22. (o_sync_q_7s)
   deleted: (q_7t)
   added: (q_8t)
   goals met: 0 of 1
23. (o_sync_q_8s)
   deleted: (q_8t)
   added: (q_9t)
   goals met: 0 of 1
24. (o_sync_q_9s)
   deleted: (q_9s) (q_9t)
   added: (q_10t)
   goals met: 0 of 1
25. (o_sync_q_10s)
   deleted: (q_10t)
   added: (q_11t)
   goals met: 0 of 1
26. (o_sync_q_11s)
   deleted: (q_11s) (q_11t)
   added: (q_12t)
   goals met: 0 of 1
27. (o_sync_q_12s)
   deleted: (q_12t) (f_sync)
   added: (f_world)
   goals met: 0 of 1
28. (stack b2 b3)
   deleted: (holding b2) (clear b3) (f_world)
   added: (clear b2) (emptyhand) (on b2 b3) (f_copy)
   goals met: 0 of 1
29. (o_copy)
   deleted: (f_copy) (q_1) (q_11)
   added: (f_sync) (q_1t) (q_1s) (q_11s)
   goals met: 0 of 1
30. (o_sync_q_1s_2)
   deleted: (q_1s) (q_1t)
   added: (q_9s) (q_1) (q_11) (q_2t)
   goals met: 0 of 1
31. (o_sync_q_2s)
   deleted: (q_2t)
   added: (q_3t)
   goals met: 0 of 1
32. (o_sync_q_3s)
   deleted: (q_3t)
   added: (q_4t)
   goals met: 0 of 1
33. (o_sync_q_4s_1)
   deleted: (q_4t)
   added: (q_5t)
   goals met: 0 of 1
34. (o_sync_q_5s_1)
   deleted: (q_5t)
   added: (q_6t)
   goals met: 0 of 1
35. (o_sync_q_6s_1)
   deleted: (q_6t)
   added: (q_7t)
   goals met: 0 of 1
36. (o_sync_q_7s)
   deleted: (q_7t)
   added: (q_8t)
   goals met: 0 of 1
37. (o_sync_q_8s)
   deleted: (q_8t)
   added: (q_9t)
   goals met: 0 of 1
38. (o_sync_q_9s)
   deleted: (q_9s) (q_9t)
   added: (q_10t)
   goals met: 0 of 1
39. (o_sync_q_10s)
   deleted: (q_10t)
   added: (q_11t)
   goals met: 0 of 1
40. (o_sync_q_11s)
   deleted: (q_11s) (q_11t)
   added: (q_12t)
   goals met: 0 of 1
41. (o_sync_q_12s)
   deleted: (q_12t) (f_sync)
   added: (f_world)
   goals met: 0 of 1
42. (pick-up b1)
   deleted: (ontable b1) (clear b1) (emptyhand) (f_world)
   added: (holding b1) (f_copy)
   goals met: 0 of 1
43. (o_copy)
   deleted: (f_copy) (q_1) (q_11)
   added: (f_sync) (q_1t) (q_1s) (q_11s)
   goals met: 0 of 1
44. (o_sync_q_1s_2)
   deleted: (q_1s) (q_1t)
   added: (q_9s) (q_1) (q_11) (q_2t)
   goals met: 0 of 1
45. (o_sync_q_2s)
   deleted: (q_2t)
   added: (q_3t)
   goals met: 0 of 1
46. (o_sync_q_3s)
   deleted: (q_3t)
   added: (q_4t)
   goals met: 0 of 1
47. (o_sync_q_4s_1)
   deleted: (q_4t)
   added: (q_5t)
   goals met: 0 of 1
48. (o_sync_q_5s_1)
   deleted: (q_5t)
   added: (q_6t)
   goals met: 0 of 1
49. (o_sync_q_6s_1)
   deleted: (q_6t)
   added: (q_7t)
   goals met: 0 of 1
50. (o_sync_q_7s)
   deleted: (q_7t)
   added: (q_8t)
   goals met: 0 of 1
51. (o_sync_q_8s)
   deleted: (q_8t)
   added: (q_9t)
   goals met: 0 of 1
52. (o_sync_q_9s)
   deleted: (q_9s) (q_9t)
   added: (q_10t)
   goals met: 0 of 1
53. (o_sync_q_10s)
   deleted: (q_10t)
   added: (q_11t)
   goals met: 0 of 1
54. (o_sync_q_11s)
   deleted: (q_11s) (q_11t)
   added: (q_12t)
   goals met: 0 of 1
55. (o_sync_q_12s)
   deleted: (q_12t) (f_sync)
   added: (f_world)
   goals met: 0 of 1
56. (stack b1 b2)
   deleted: (holding b1) (clear b2) (f_world)
   added: (clear b1) (emptyhand) (on b1 b2) (f_copy)
   goals met: 0 of 1
57. (o_copy)
   deleted: (f_copy) (q_1) (q_11)
   added: (f_sync) (q_1t) (q_1s) (q_11s)
   goals met: 0 of 1
58. (o_sync_q_1s_2)
   deleted: (q_1s) (q_1t)
   added: (q_9s) (q_1) (q_11) (q_2t)
   goals met: 0 of 1
59. (o_sync_q_2s)
   deleted: (q_2t)
   added: (q_3t)
   goals met: 0 of 1
60. (o_sync_q_3s)
   deleted: (q_3t)
   added: (q_4t)
   goals met: 0 of 1
61. (o_sync_q_4s_1)
   deleted: (q_4t)
   added: (q_5t)
   goals met: 0 of 1
62. (o_sync_q_5s_1)
   deleted: (q_5t)
   added: (q_6t)
   goals met: 0 of 1
63. (o_sync_q_6s_1)
   deleted: (q_6t)
   added: (q_7t)
   goals met: 0 of 1
64. (o_sync_q_7s)
   deleted: (q_7t)
   added: (q_8t)
   goals met: 0 of 1
65. (o_sync_q_8s)
   deleted: (q_8t)
   added: (q_9t)
   goals met: 0 of 1
66. (o_sync_q_9s)
   deleted: (q_9s) (q_9t)
   added: (q_10t)
   goals met: 0 of 1
67. (o_sync_q_10s)
   deleted: (q_10t)
   added: (q_11t)
   goals met: 0 of 1
68. (o_sync_q_11s)
   deleted: (q_11s) (q_11t)
   added: (q_12t)
   goals met: 0 of 1
69. (o_sync_q_12s)
   deleted: (q_12t) (f_sync)
   added: (f_world)
   goals met: 0 of 1
70. (pick-up b4)
   deleted: (ontable b4) (clear b4) (emptyhand) (f_world)
   added: (holding b4) (f_copy)
   goals met: 0 of 1
71. (o_copy)
   deleted: (f_copy) (q_1) (q_11)
   added: (f_sync) (q_1t) (q_1s) (q_11s)
   goals met: 0 of 1
72. (o_sync_q_1s_1)
   deleted: (q_1s) (q_1t)
   added: (q_2s) (q_2t)
   goals met: 0 of 1
73. (o_sync_q_2s)
   deleted: (q_2s) (q_2t)
   added: (q_6s) (q_3s) (q_3t)
   goals met: 0 of 1
74. (o_sync_q_3s)
   deleted: (q_3s) (q_3t)
   added: (q_5s) (q_4s) (q_4t)
   goals met: 0 of 1
75. (o_sync_q_4s_1)
   deleted: (q_4s) (q_4t)
   added: (q_7s) (q_5t)
   goals met: 0 of 1
76. (o_sync_q_5s_1)
   deleted: (q_5s) (q_5t)
   added: (q_8s) (q_6t)
   goals met: 0 of 1
77. (o_sync_q_6s_1)
   deleted: (q_6s) (q_6t)
   added: (q_10s) (q_7t)
   goals met: 0 of 1
78. (o_sync_q_7s)
   deleted: (q_7s) (q_7t)
   added: (q_8t)
   goals met: 0 of 1
79. (o_sync_q_8s)
   deleted: (q_8s) (q_8t)
   added: (q_9t)
   goals met: 0 of 1
80. (o_sync_q_9s)
   deleted: (q_9t)
   added: (q_10t)
   goals met: 0 of 1
81. (o_sync_q_10s)
   deleted: (q_10s) (q_10t)
   added: (q_11t)
   goals met: 0 of 1
82. (o_sync_q_11s)
   deleted: (q_11s) (q_11t)
   added: (q_12t)
   goals met: 0 of 1
83. (o_sync_q_12s)
   deleted: (q_12t) (f_sync)
   added: (f_world)
   goals met: 0 of 1
84. (o_goal)
   added: (f_goal)
   goals met: 1 of 1
